In [27]:
import pandas as pd 
import numpy as np

# 1 Creation d'un DataFrame à partir du fichier Personne.csv
df = pd.read_csv("Personne - Personne.csv" , sep=',')

# 2 les 10 premières entrées après la création du DataFrame
print(f"- Les 10 premières entrées : \n{df.loc[0 : 10]}")

# 3 nombre dobservation
print(f"- Nombre d\'observation : {df.shape[0]}")

# 4 Nombre de colone 
print(f"- Nombre de colones : {df.shape[1]}")

# 5 le nom de toutes les colonnes
print(f"- Le nom de tous les colones : \n{df.columns}")

# 6 indexation 
print(f"- L\'ensemble de données est indexé : {df.index}")

- Les 10 premières entrées :
    id     Nom     Prénom  Age  Taille  Poids   Salaire
0    1   Nom_1   Prenom_1   39  173.27  73.21  10084.34
1    2   Nom_2   Prenom_2   37  166.89  54.76  11533.22
2    3   Nom_3   Prenom_3   22  191.06  50.02  10808.93
3    4   Nom_4   Prenom_4   29  193.09  71.94  11697.27
4    5   Nom_5   Prenom_5   36  159.19  52.21   9210.91
5    6   Nom_6   Prenom_6   39  172.40  78.27  11190.55
6    7   Nom_7   Prenom_7   42  171.66  79.95   8663.09
7    8   Nom_8   Prenom_8   39  168.05  58.51  11220.31
8    9   Nom_9   Prenom_9   42  182.98  66.85   8793.78
9   10  Nom_10  Prenom_10   38  195.00  56.57  11440.60
10  11  Nom_11  Prenom_11   42  177.95  60.07  10751.75
- Nombre d'observation : 5000
- Nombre de colones : 7
- Le nom de tous les colones :
Index(['id', 'Nom', 'Prénom', 'Age', 'Taille', 'Poids', 'Salaire'], dtype='object')
- L'ensemble de données est indexé : RangeIndex(start=0, stop=5000, step=1)

In [26]:
# 7 Type de chaque colone
print(f"- Type de chaque colone : \n{df.dtypes}")
# 8 Afficher la colonne « Salaire »
print(f"- Le contenu du colone salaire : \n{df.loc[: , ['Salaire']]}")

- Type de chaque colone :
id           int64
Nom         object
Prénom      object
Age          int64
Taille     float64
Poids      float64
Salaire    float64
dtype: object
- Le contenu du colone salaire :
       Salaire
0     10084.34
1     11533.22
2     10808.93
3     11697.27
4      9210.91
...        ...
4995   9244.03
4996   8413.23
4997   7099.65
4998  13289.69
4999  12371.97

[5000 rows x 1 columns]

In [39]:
# 9 Le nombre d'âges différents dans l'ensemble de données
print(f"Le nombre d\'âges différents dans l\'ensemble de données : {df["Age"].nunique()}")

# 10 l'âge le plus fréquent
print(f"l\'âge le plus fréquent : {df["Age"].value_counts().idxmax()}")

# 11 le salaire le moins fréquent
print(f"le salaire le moins fréquent : {df["Salaire"].value_counts().idxmin()}")

Le nombre d'âges différents dans l'ensemble de données : 22
l'âge le plus fréquent : 36
le salaire le moins fréquent : 6780.66

In [40]:
# 12 Résumez le DataFrame
print(f"Résumez le DataFrame : \n{df.describe()}")

Résumez le DataFrame :
                id          Age       Taille        Poids       Salaire
count  5000.000000  5000.000000  5000.000000  5000.000000   5000.000000
mean   2500.500000    31.569400   174.944166    72.346476  10049.931716
std    1443.520003     6.399295    14.359552    12.991692   2305.314949
min       1.000000    21.000000   150.010000    50.000000   6001.460000
25%    1250.750000    26.000000   162.535000    61.065000   8036.570000
50%    2500.500000    32.000000   174.790000    72.210000  10065.770000
75%    3750.250000    37.000000   187.482500    83.642500  12064.845000
max    5000.000000    42.000000   200.000000    94.990000  13999.970000

In [41]:
# 13 Résumer toutes les colonnes du Dataframe
print(f"Résumer toutes les colonnes du Dataframe : \n{df.describe(include='all')}")

Résumer toutes les colonnes du Dataframe :
                 id    Nom    Prénom          Age       Taille        Poids  \
count   5000.000000   5000      5000  5000.000000  5000.000000  5000.000000
unique          NaN   5000      5000          NaN          NaN          NaN
top             NaN  Nom_1  Prenom_1          NaN          NaN          NaN
freq            NaN      1         1          NaN          NaN          NaN
mean    2500.500000    NaN       NaN    31.569400   174.944166    72.346476
std     1443.520003    NaN       NaN     6.399295    14.359552    12.991692
min        1.000000    NaN       NaN    21.000000   150.010000    50.000000
25%     1250.750000    NaN       NaN    26.000000   162.535000    61.065000
50%     2500.500000    NaN       NaN    32.000000   174.790000    72.210000
75%     3750.250000    NaN       NaN    37.000000   187.482500    83.642500
max     5000.000000    NaN       NaN    42.000000   200.000000    94.990000

             Salaire
count    5000.000000
unique           NaN
top              NaN
freq             NaN
mean    10049.931716
std      2305.314949
min      6001.460000
25%      8036.570000
50%     10065.770000
75%     12064.845000
max     13999.970000

In [59]:
# 14 "Age" est supérieure à 25
print(f"Age sup que 25 : \n{df["Age"].loc[df["Age"]>25]}")

Age sup que 25 :
0       39
1       37
3       29
4       36
5       39
        ..
4995    34
4996    28
4997    30
4998    33
4999    42
Name: Age, Length: 3854, dtype: int64

In [60]:
# 15 la valeur à la deuxième ligne et à la troisième colonne
print(f"La valeur deuxième ligne et troisième colonne : {df.iloc[1 , 2]}")

# 16 Toutes les lignes pour lesquelles la colonne "Taille" est supérieure à 170
print(f"Les Valeurs sup a 170 : \n{df["Taille"].loc[df["Taille"]>170]}")

La valeur deuxième ligne et troisième colonne : Prenom_2
Les Valeurs sup a 170 :
0       173.27
2       191.06
3       193.09
5       172.40
6       171.66
         ...
4991    197.17
4995    171.76
4996    177.82
4998    178.79
4999    191.06
Name: Taille, Length: 2996, dtype: float64

In [73]:
# 17 La première ligne et les deux premières colonnes
print(f"La première ligne et les deux premières colonnes : \n{df.iloc[ 0 , 0 : 2 ]}")

# 18 Toutes les lignes où la colonne "Salaire" est supérieure à 7000 et la colonne "Age" est égale à 30
print(f"Salaire supérieur à 7000 & Age supérieur à 30 :\n{df.loc[(df['Salaire'] > 7000) & (df['Age'] > 30)]}")

La première ligne et les deux premières colonnes :
id         1
Nom    Nom_1
Name: 0, dtype: object
Salaire supérieur à 7000 & Age supérieur à 30 :
        id       Nom       Prénom  Age  Taille  Poids   Salaire
0        1     Nom_1     Prenom_1   39  173.27  73.21  10084.34
1        2     Nom_2     Prenom_2   37  166.89  54.76  11533.22
4        5     Nom_5     Prenom_5   36  159.19  52.21   9210.91
5        6     Nom_6     Prenom_6   39  172.40  78.27  11190.55
6        7     Nom_7     Prenom_7   42  171.66  79.95   8663.09
...    ...       ...          ...  ...     ...    ...       ...
4993  4994  Nom_4994  Prenom_4994   32  157.29  70.26   7816.15
4994  4995  Nom_4995  Prenom_4995   42  164.68  90.31   7047.74
4995  4996  Nom_4996  Prenom_4996   34  171.76  51.14   9244.03
4998  4999  Nom_4999  Prenom_4999   33  178.79  76.82  13289.69
4999  5000  Nom_5000  Prenom_5000   42  191.06  52.72  12371.97

[2426 rows x 7 columns]

In [74]:
# 19 Trier le Dataframe par âge des personnes
df.sort_values("Age" , inplace=True)

        id       Nom       Prénom  Age  Taille  Poids   Salaire
1606  1607  Nom_1607  Prenom_1607   21  188.34  93.89   8729.97
1692  1693  Nom_1693  Prenom_1693   21  166.47  80.79   8702.91
1716  1717  Nom_1717  Prenom_1717   21  192.97  83.90  12401.14
1735  1736  Nom_1736  Prenom_1736   21  169.47  63.24   6361.12
3728  3729  Nom_3729  Prenom_3729   21  199.22  50.83  12771.95
...    ...       ...          ...  ...     ...    ...       ...
2041  2042  Nom_2042  Prenom_2042   42  159.41  61.87  12717.57
1696  1697  Nom_1697  Prenom_1697   42  164.59  86.05  11898.82
741    742   Nom_742   Prenom_742   42  178.47  86.14   8335.32
894    895   Nom_895   Prenom_895   42  195.86  87.18  13589.59
4999  5000  Nom_5000  Prenom_5000   42  191.06  52.72  12371.97

[5000 rows x 7 columns]

In [81]:
# 20 le salaire de la personne la plus jeune
print(f"le salaire de la personne la plus jeune : \n{df.sort_values(by="Age").iloc[0]}")

le salaire de la personne la plus jeune :
id                1607
Nom           Nom_1607
Prénom     Prenom_1607
Age                 21
Taille          188.34
Poids            93.89
Salaire        8729.97
Name: 1606, dtype: object

In [92]:
# 21 fonction lambda qui mettra en majuscule les chaînes de caractères.
upperCase = lambda chaine : chaine.upper()

# 22 mettre nom & prenom en majuscule
df["Nom"] = df["Nom"].apply(upperCase)
df["Prénom"] = df["Prénom"].apply(upperCase)
print(f"Nom & prenom en majuscule : \n{df[["Nom" , "Prénom"]]}")

Nom & prenom en majuscule :
           Nom       Prénom
0        NOM_1     PRENOM_1
1        NOM_2     PRENOM_2
2        NOM_3     PRENOM_3
3        NOM_4     PRENOM_4
4        NOM_5     PRENOM_5
...        ...          ...
4995  NOM_4996  PRENOM_4996
4996  NOM_4997  PRENOM_4997
4997  NOM_4998  PRENOM_4998
4998  NOM_4999  PRENOM_4999
4999  NOM_5000  PRENOM_5000

[5000 rows x 2 columns]

In [93]:
# 23 la prime annuelle de chaque employé
def primeAnnuel ( salaire ) :
    return salaire * 0.10

df["Prime Annuelle"] = df["Salaire"].apply(primeAnnuel)
df

,id,Nom,Prénom,Age,Taille,Poids,Salaire,Prenom,Prime Annuelle
0,1,NOM_1,PRENOM_1,39,173.27,73.21,10084.34,PRENOM_1,1008.434
1,2,NOM_2,PRENOM_2,37,166.89,54.76,11533.22,PRENOM_2,1153.322
2,3,NOM_3,PRENOM_3,22,191.06,50.02,10808.93,PRENOM_3,1080.893
3,4,NOM_4,PRENOM_4,29,193.09,71.94,11697.27,PRENOM_4,1169.727
4,5,NOM_5,PRENOM_5,36,159.19,52.21,9210.91,PRENOM_5,921.091
...,...,...,...,...,...,...,...,...,...
4995,4996,NOM_4996,PRENOM_4996,34,171.76,51.14,9244.03,PRENOM_4996,924.403
4996,4997,NOM_4997,PRENOM_4997,28,177.82,50.51,8413.23,PRENOM_4997,841.323
4997,4998,NOM_4998,PRENOM_4998,30,153.11,91.33,7099.65,PRENOM_4998,709.965
4998,4999,NOM_4999,PRENOM_4999,33,178.79,76.82,13289.69,PRENOM_4999,1328.969
4999,5000,NOM_5000,PRENOM_5000,42,191.06,52.72,12371.97,PRENOM_5000,1237.197

In [101]:
# 24 Grouper selon Age & Calculer la moyenne des salaires pour chaque groupe d'âge
groupAge = df.groupby("Age")["Salaire"].mean()
print(groupAge)

Age
21    10119.726420
22     9981.018515
23    10048.084820
24     9880.982837
25     9898.889747
26    10230.765455
27    10444.025256
28    10078.641106
29    10138.074234
30    10210.449773
31    10069.967048
32    10126.509957
33     9892.771587
34     9764.361472
35    10055.175684
36     9977.249494
37     9876.418834
38    10139.296776
39    10055.887439
40     9984.453964
41     9995.321759
42    10096.159431
Name: Salaire, dtype: float64

In [106]:
# 25 colonne 'catégorie de poids’
def categoriePoids ( poid ) :
    if poid <= 50 :
        return "Très léger"
    elif poid > 50  and poid <= 70 :
        return "Lèger"
    elif poid > 70 and poid <= 90 :
        return "Moyen"
    elif poid > 90 :
        return "Lourd"
    
df["catégorie de poids"] = df["Poids"].apply(categoriePoids)
df

,id,Nom,Prénom,Age,Taille,Poids,Salaire,Prenom,Prime Annuelle,catégorie de poids
0,1,NOM_1,PRENOM_1,39,173.27,73.21,10084.34,PRENOM_1,1008.434,Moyen
1,2,NOM_2,PRENOM_2,37,166.89,54.76,11533.22,PRENOM_2,1153.322,Lèger
2,3,NOM_3,PRENOM_3,22,191.06,50.02,10808.93,PRENOM_3,1080.893,Lèger
3,4,NOM_4,PRENOM_4,29,193.09,71.94,11697.27,PRENOM_4,1169.727,Moyen
4,5,NOM_5,PRENOM_5,36,159.19,52.21,9210.91,PRENOM_5,921.091,Lèger
...,...,...,...,...,...,...,...,...,...,...
4995,4996,NOM_4996,PRENOM_4996,34,171.76,51.14,9244.03,PRENOM_4996,924.403,Lèger
4996,4997,NOM_4997,PRENOM_4997,28,177.82,50.51,8413.23,PRENOM_4997,841.323,Lèger
4997,4998,NOM_4998,PRENOM_4998,30,153.11,91.33,7099.65,PRENOM_4998,709.965,Lourd
4998,4999,NOM_4999,PRENOM_4999,33,178.79,76.82,13289.69,PRENOM_4999,1328.969,Moyen
4999,5000,NOM_5000,PRENOM_5000,42,191.06,52.72,12371.97,PRENOM_5000,1237.197,Lèger

In [109]:
# 26 La catégorie de poids la plus courante
print(f"Categorie du poid plus courante : \n{df["catégorie de poids"].value_counts().idxmax()}")

Categorie du poid plus courante :
Moyen

In [119]:
# 27 groupe d'âge et catégorie de poids, puis calculer la moyenne des salaires pour chaque combinaison.
moySalaire = df.groupby(["Age" , "catégorie de poids"])["Salaire"].mean()
print(f"Moyenne de salaire par Age & categorie de poids : \n{moySalaire}")

Moyenne de salaire par Age & categorie de poids :

Age  catégorie de poids
21   Lourd                  9998.593704
     Lèger                 10068.749817
     Moyen                 10202.222056
22   Lourd                  9586.951176
     Lèger                 10003.921727
                               ...
41   Lèger                 10048.863370
     Moyen                 10074.402360
42   Lourd                  9644.189200
     Lèger                 10288.649292
     Moyen                  9999.380741
Name: Salaire, Length: 67, dtype: float64

In [121]:
# 28 Statistiques pour categorie de poids
print("Des statistiques pour chaque catégorie de poids")
df.groupby("catégorie de poids")["Taille"].describe()

Des statistiques pour chaque catégorie de poids

,count,mean,std,min,25%,50%,75%,max
catégorie de poids,,,,,,,,
Lourd,512.0,175.775488,14.911754,150.07,162.2000,176.06,189.5725,199.85
Lèger,2241.0,174.965199,14.318334,150.02,162.5900,174.92,187.2300,199.99
Moyen,2246.0,174.744439,14.265837,150.01,162.6175,174.01,187.3700,200.00
Très léger,1.0,150.760000,NaN,150.76,150.7600,150.76,150.7600,150.76

In [123]:
# 29 La moyenne, le maximum, le minimum et la médiane des salaires regroupés par catégorie de poids.
df.groupby("catégorie de poids")["Salaire"].agg(["mean" , "max" , "min" , "median"])

                            mean       max       min     median
catégorie de poids
Lourd                9936.055449  13949.11   6005.97   9866.335
Lèger               10041.194516  13999.55   6002.86  10080.400
Moyen               10083.478246  13999.97   6001.46  10093.470
Très léger          12589.140000  12589.14  12589.14  12589.140

In [124]:
df.to_csv("DataFrame.csv")

In [125]:
df

,id,Nom,Prénom,Age,Taille,Poids,Salaire,Prenom,Prime Annuelle,catégorie de poids
0,1,NOM_1,PRENOM_1,39,173.27,73.21,10084.34,PRENOM_1,1008.434,Moyen
1,2,NOM_2,PRENOM_2,37,166.89,54.76,11533.22,PRENOM_2,1153.322,Lèger
2,3,NOM_3,PRENOM_3,22,191.06,50.02,10808.93,PRENOM_3,1080.893,Lèger
3,4,NOM_4,PRENOM_4,29,193.09,71.94,11697.27,PRENOM_4,1169.727,Moyen
4,5,NOM_5,PRENOM_5,36,159.19,52.21,9210.91,PRENOM_5,921.091,Lèger
...,...,...,...,...,...,...,...,...,...,...
4995,4996,NOM_4996,PRENOM_4996,34,171.76,51.14,9244.03,PRENOM_4996,924.403,Lèger
4996,4997,NOM_4997,PRENOM_4997,28,177.82,50.51,8413.23,PRENOM_4997,841.323,Lèger
4997,4998,NOM_4998,PRENOM_4998,30,153.11,91.33,7099.65,PRENOM_4998,709.965,Lourd
4998,4999,NOM_4999,PRENOM_4999,33,178.79,76.82,13289.69,PRENOM_4999,1328.969,Moyen
4999,5000,NOM_5000,PRENOM_5000,42,191.06,52.72,12371.97,PRENOM_5000,1237.197,Lèger